reference/reference_node_types.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Pallet - Node Types</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-01-21 12:57:27 EST"/>
<meta name="author" content="Hugo Duncan"/>
<meta name="description" content="Pallet Node Types"/>
<meta name="keywords" content="pallet node type definition template tag phases"/>
<link rel="stylesheet" type="text/css" href="doc.css" /><link rel="stylesheet" type="text/css" href="http://fonts.googleapis.com/css?family=Molengo"/>
<link rel="stylesheet" type="text/css" href="../doc.css" /><link rel="stylesheet" type="text/css" href="http://fonts.googleapis.com/css?family=Molengo"/>

</head>
<body>
<div id="content">
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<h1 class="title">Pallet - Node Types</h1>

<p>In pallet, node types are defined with <code>defnode</code>.  The minimum requirement is
for a tag and an empty image template specification.
</p>



<pre class="src src-clojure">(<span style="color: #0000ff;">require</span> 'pallet.core)
(pallet.core/defnode mytag {})
</pre>




<p>
An empty template specification implies a default image will be used for the
nodes, usually the latest Ubuntu version, or CentOS if no Ubuntu images are
available.
</p>
<p>
Node types can also specify phase functions, which can be invoked using
<code>converge</code> or <code>lift</code>.
</p>



<pre class="src src-clojure">(<span style="color: #0000ff;">require</span> 'pallet.core)
(<span style="color: #0000ff;">require</span> 'pallet.resource.package)
(pallet.core/defnode mytag {}
  <span style="color: #0000ff;">:configure</span> (pallet.resource/phase
               (pallet.resource.package/package <span style="color: #f4a460;">"wget"</span>)))
</pre>




<p>
Node types are used to select the nodes targeted by a <a href="operations.html"><code>converge</code> or <code>lift</code> operation</a>.
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Tags </h2>
<div class="outline-text-2" id="text-1">


<p>
In pallet, tags are used to identify identically configured machines.  The
<code>converge</code> command can be used to control the number of machines running with
each tag, allowing simple cluster management. Tag names may not contain hyphens.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Image Templates </h2>
<div class="outline-text-2" id="text-2">


<p>
The image used for a node can be specified by using JCloud's template
mechanism.  The image template in <code>defnode</code> is exactly as for jclouds clojure API,
and is a map of option/value pairs.
</p>



<pre class="src src-clojure">(<span style="color: #0000ff;">require</span> 'pallet.core)
(pallet.core/defnode mytag {<span style="color: #0000ff;">:os-family</span> <span style="color: #0000ff;">:ubuntu</span> <span style="color: #0000ff;">:min-ram</span> 512 <span style="color: #0000ff;">:min-cores</span> 4})
</pre>




</div>
</div>
<div id="postamble">
<p class="author"> Author: Hugo Duncan
</p>
<p class="date"> Date: 2011-01-21 12:57:27 EST</p>
<p class="creator">HTML generated by org-mode 7.4 in emacs 24</p>
</div>
</div>
</body>
</html>
